/* eslint-disable no-irregular-whitespace */
/* eslint-disable no-console */

export default function sayHello() {
  console.log(
    '%c██   ██ ███████ ██      ██       ██████      ██████  ███████ ██    ██ ███████ ██       ██████  ██████  ███████ ██████  ██\n' +
      '%c██   ██ ██      ██      ██      ██    ██     ██   ██ ██      ██    ██ ██      ██      ██    ██ ██   ██ ██      ██   ██ ██\n' +
      '%c███████ █████   ██      ██      ██    ██     ██   ██ █████   ██    ██ █████   ██      ██    ██ ██████  █████   ██████  ██\n' +
      '%c██   ██ ██      ██      ██      ██    ██     ██   ██ ██       ██  ██  ██      ██      ██    ██ ██      ██      ██   ██   \n' +
      '%c██   ██ ███████ ███████ ███████  ██████      ██████  ███████   ████   ███████ ███████  ██████  ██      ███████ ██   ██ ██',
    'color: #4ee5ae;',
    'color: #4ee6a8;',
    'color: #4ee5ac;',
    'color: #4ee5b4;',
    'color: #4ee2d9;'
  );

  console.log(
    '看起来你对网站的代码很感兴趣 👀\n这是 repo 🔗以满足你的好奇心' +
      '%chttps://github.com/bjut-swift/swifts-nest\n\n' +
      '%c别忘了给它点个🌟',
    'font-family: Inter, sans-serif; font-size: 1.2rem; font-weight: 500;',
    'font-family: Inter, sans-serif; font-size: 1.2rem; font-weight: 500; color: #4ee5ae;',
    'font-family: Inter, sans-serif; font-size: 1.2rem; font-weight: 500;'
  );
}
